from config.telegram import  InlineKeyboardButton, InlineKeyboardMarkup
text = """ما هو موقع Ichancy؟

موقع Ichancy هو منصة ترفيهية متكاملة تُقدم خدمات المراهنات الرياضية، ألعاب السلوت، ألعاب الكازينو، وألعاب متنوعة (Games)، مع نظام آلي لحساب الأرباح بناءً على النسب المرتبطة بكل خيار.

أقسام الموقع:

1. الرياضة (Sports):
يتيح للمستخدمين المراهنة على مجموعة واسعة من الأحداث الرياضية، مثل كرة القدم، كرة السلة، التنس وغيرها، مع خيارات متعددة ونسب متغيرة.

آلية العمل :

يختار المراهن خيارًا رياضيًا واحدًا أو أكثر قبل بدء الحدث.

تُضرب النسبة المحددة (Odds) في مبلغ الرهان لتحديد العائد المحتمل.

إذا تحقق الخيار، يحصل المستخدم على المبلغ الناتج من العملية.

تعتمد المراهنة على احتمالية الربح أو الخسارة.

2. السلوت (Slot):
ألعاب الحظ الممتعة برسومات جذابة وآليات دوران بسيطة، حيث يمكن للمستخدم تجربة حظه والفوز بمكافآت فورية.

3. الكازينو (Casino):
مجموعة متنوعة من ألعاب الكازينو التقليدية مثل الروليت، البلاك جاك، البوكر، وغيرها، ضمن تجربة محاكاة احترافية.

4. الألعاب (Games):
يضم هذا القسم ألعابًا إلكترونية وتفاعلية مسلية، تتنوع بين ألعاب الحظ، ألعاب المهارة، والتحديات السريعة، حيث يمكن للمستخدم اللعب والفوز بجوائز مباشرة.

لزيارة الموقع الرسمي:
https://ichancy.com"""
async def handle_guides_what_is_ichancy(query):
    keyboard = [[InlineKeyboardButton("رجوع للشروحات", callback_data='guides')]]
    reply_markup = InlineKeyboardMarkup(keyboard)
    await query.edit_message_text(text, reply_markup=reply_markup, parse_mode='Markdown')
